/* a. undefined
Значение присвоено не будет, так как не будет выполнено условие отсутствия переменной.
*/

/* b. error
Невозможно получить значение переменной, так как она не была объявлена.
*/

/* c.
    function a(x) {
    return x * 2;
}
Значение 'a' является функцией, потому что объявление функции имеет приоритет над объявлениями переменных.
*/

/* d. 10
В функции произошла замена значения аргумента по индексу.
*/

/* e. [object Window]
Не был передан объект, вследствие чего this вывелся привязанным к Window.
*/