/*
Замыкание — это комбинация функции и лексического окружения, в котором эта функция была объявлена.
Замыкания полезны тем, что позволяют связать данные с функцией, которая работает с этими данными.
Чаще всего это используют, чтобы сделать переменную, которая на самом деле работает как функция.
Такие ситуации повсеместно встречаются в web-разработке.
Описывается какое-то поведение, а затем связывается с событием, которое создаётся пользователем 
(например, клик мышкой или нажатие клавиши). 
Также, замыкания применяются в защите данных (инкапсуляция).
*/